{
    "start": {
      "text": "You open your eyes, feeling exhausted, staring at the mirror with self-loathing.",
      "choices": [
        { "text": "Try to collect yourself and prepare for class", "next": "classroom" },
        { "text": "Keep sitting on the bed, doing nothing", "next": "despair" }
      ]
    },
    "classroom": {
      "text": "You arrive at the classroom, and the physics teacher calls you to solve a problem on the board, but you are completely lost.",
      "choices": [
        { "text": "Try to solve the problem", "next": "try_solution" },
        { "text": "Stay silent and lower your head", "next": "shame" }
      ]
    },
    "despair": {
      "text": "You sit on the bed, feeling like a complete failure. The thought of punishment for being late adds to your anxiety.",
      "choices": [
        { "text": "Reluctantly go to class", "next": "classroom" },
        { "text": "Decide to take the day off and avoid everything", "next": "avoidance" }
      ]
    },
    "try_solution": {
      "text": "You try hard to solve the problem but realize you can’t figure it out. The teacher harshly criticizes you, leaving you feeling embarrassed and blank.",
      "choices": [
        { "text": "Stand silently until class ends", "next": "after_class" },
        { "text": "Mutter an apology and return to your seat", "next": "shame" }
      ]
    },
    "after_class": {
      "text": "After class, you quietly return to your seat, feeling drained. A classmate who you rarely talk to says, 'Don’t worry about it,' bringing a small warmth to your heart.",
      "choices": [
        { "text": "Muster the courage to say 'Thank you'", "next": "end_success" },
        { "text": "Force a smile and stay silent", "next": "after_school" }
      ]
    },
    "shame": {
      "text": "You lower your head, feeling the mocking gazes of the entire class. Your self-esteem takes a huge hit.",
      "choices": [
        { "text": "Pretend to stay calm and wait for class to end", "next": "end_normal" },
        { "text": "Run out of the classroom immediately", "next": "avoidance" }
      ]
    },
    "avoidance": {
      "text": "You choose to avoid the situation, but it doesn’t ease your pain. You feel utterly hopeless.",
      "choices": [
        { "text": "Reflect and try to face it again", "next": "classroom" },
        { "text": "Completely give up and sink into deeper self-blame", "next": "end_bad" }
      ]
    },
    "end_success": {
      "text": "Although you felt immense pressure, you held on. After class, a classmate expressed concern for you, which brought a small warmth to your heart.",
      "education": "Perseverance and seeking support are crucial for helping people with depression. Even a small act of kindness can change someone's world."
    },
    "end_normal": {
      "text": "You barely made it to the end of class, but you still feel defeated and that nothing has changed.",
      "education": "People with depression often feel defeated despite their efforts, but this is part of the recovery process. Patience and support are key."
    },
    "end_bad": {
      "text": "You completely give up on yourself, sinking into deep despair. No one understands you, and you feel abandoned by the world.",
      "education": "People with depression often feel hopeless, but seeking psychological help in time can save lives. Care and listening are crucial."
    },
    "after_school": {
      "text": "After school, you walk home alone, hearing the laughter of other students. Yet, you feel out of place in this world.",
      "choices": [
        { "text": "Try sending a message to a friend", "next": "friend_response" },
        { "text": "Lower your head and walk home quickly", "next": "at_home" }
      ]
    },
    "friend_response": {
      "text": "You send a message: 'Are you there?' A few minutes later, the other person replies with a busy emoji, and you feel disappointed.",
      "choices": [
        { "text": "Tell yourself not to bother others again", "next": "end_bad" },
        { "text": "Persist and try to chat with them", "next": "small_relief" }
      ]
    },
    "small_relief": {
      "text": "Although the other person didn’t chat deeply, you feel a little better. Maybe you’re not completely ignored.",
      "choices": [
        { "text": "Go home and continue studying", "next": "at_home" },
        { "text": "Stare into space until late at night", "next": "night_crisis" }
      ]
    },
    "night_crisis": {
      "text": "Late at night, you sit on your bed, your mind a mess. Negative emotions overwhelm you, making it hard to breathe.",
      "choices": [
        { "text": "Call a mental health hotline", "next": "call_hotline" },
        { "text": "Decide to endure and do nothing", "next": "end_bad" }
      ]
    },
    "call_hotline": {
      "text": "You dial a mental health hotline, and a warm voice comforts you. For the first time, you feel you’re not alone.",
      "education": "Mental health hotlines can help those with depression manage crises. Seeking timely help is crucial.",
      "choices": [
        { "text": "Restart the game", "next": "start" }
      ]
    },
    "at_home": {
      "text": "You arrive home. Your mother is busy taking care of your younger sibling, leaving you feeling ignored. You lie in bed, staring into space.",
      "choices": [
        { "text": "Close your eyes and sleep", "next": "night_crisis" },
        { "text": "Try to talk to your mother", "next": "end_normal" }
      ]
    }
  }
  